/**
 * Типи для компонента вибору
 */

/**
 * Пропси для компонента вибору
 */
export interface SelectProps<T> {
  /**
   * Мітка компонента
   */
  label?: string;
  
  /**
   * Вибране значення
   */
  value: T | null;
  
  /**
   * Функція, яка викликається при зміні значення
   */
  onValueChange: (value: T) => void;
  
  /**
   * Список елементів для вибору
   */
  items: T[];
  
  /**
   * Текст заповнювача, коли значення не вибрано
   */
  placeholder?: string;
  
  /**
   * Чи вимкнений компонент
   */
  disabled?: boolean;
  
  /**
   * Функція для отримання відображуваного тексту елемента
   */
  itemLabelGetter?: (item: T) => string;
}
