/**
 * Типи для специфікацій автомобілів
 */

/**
 * Типи двигунів
 */
export type EngineType = 'Бензин' | 'Дизель' | 'Гібрид' | 'Електричний' | 'Газ' | 'Газ/Бензин';

/**
 * Типи кузовів
 */
export type BodyType = 'Седан' | 'Хетчбек' | 'Універсал' | 'Купе' | 'Кабріолет' | 'Пікап' | 'Кросовер' | 'Позашляховик' | 'Мінівен' | 'Фургон';

/**
 * Типи трансмісій
 */
export type TransmissionType = 'automatic' | 'manual' | 'semi_automatic' | 'variator';

/**
 * Кольори автомобілів
 */
export type CarColor = 'Білий' | 'Чорний' | 'Сірий' | 'Сріблястий' | 'Червоний' | 'Синій' | 'Зелений' | 'Жовтий' | 'Оранжевий' | 'Коричневий' | 'Бежевий' | 'Бордовий' | 'Фіолетовий' | 'Золотий' | 'Хром';
